import { SetMetadata } from '@nestjs/common';

export const SKIP_AUTH = 'SKIP_AUTH';
export const SkipAuth = () => SetMetadata(SKIP_AUTH, true);
// @SkipAuth() - це наш кастомний декоратор
// (декоратор який створили ми, він НЕ вбудований),
// використовується над кожним ендпоінтом,
// де потрібно пропускати використання нашого клобального guards,
// тобто ми приходимо на потрібний нам ендпоінт і там до тих даних що нам приходять,
// додаються ще метадані SetMetadata(SKIP_AUTH, true)
// і ми робимо метод доступний без аутентифікації.
// SKIP_AUTH — це константа, яка зберігає назву метаданих.
// Вона використовується для позначення того,
// що аутентифікація для певного маршруту має бути пропущена
// SkipAuth() — це кастомний декоратор (створений нами, НЕ вбудовани),
// створений за допомогою SetMetadata.
// SetMetadata(SKIP_AUTH, true) додає метадані до обраного маршруту,
// де ключ — це SKIP_AUTH, а значення — true. Це означає,
// що для цього маршруту можна пропустити аутентифікацію.
